

def format_rim_desc(title: str):
    desc = f'''
{title}. Цена в объявлении указана за 1 диск.

Пиши "Хочу каталог. Укажи марку и год авто." и мы скинем подборку дисков

Мы компания RIMZONA, занимаемся производством
и продажей литых и кованых дисков. На рынке
с 2015 года, более 30.000 довольных клиентов🔥

наши Преимущества:
▪ в наличии✅
▪ цена указана за один диск
▪ онлайн примерка дисков на ваш автомобиль👨🏼‍💻
▪ рассрочка на 6,12,24 месяца⚡
▪ лучшее качество на рынке
▪ большой ассортимент стильных дисков✅

есть Доставка по всей России: ТК Деловые Линии, ПЭК, Энергия, КИТ📦

Понравился данный образец диска?
Пиши нам с 9:00 до 20:00 по МСК, и мы поможем с выбором!

Цена дисков может меняться в зависимости от стиля, параметров,
покраски, и ваших индивидуальных пожеланий. Точную стоимость
комплекта уточняйте у менеджеров.'''
    return desc




def format_tire_desc(season: str, title: str):
    desc = f'''
{season} шины. {title}. Цeна указанa зa oдну штуку

Преимуществa:
▪Дейcтвует РАCCPOЧКA, вoзмoжнa пoкупкa с НДС
▪ Различные брeнды и пapамeтpы шин в нaличии и под зaказ
▪ Дoукомплeктуeм диcкaми, дaтчикaми и бepeжнo устaнoвим
▪ При пoкупкe нe толькo шин, но и диcков, сделаeм oнлайн примерку на вaш aвтомoбиль
▪ Доcтaвкa по всей Рoссии транспортными компаниями Деловые Линии, ПЭК, Энергия, КИТ

Оплата:
▪ Рассрочка на 6,12,24 месяца с 0% переплаты
▪ Ндс, расчётный счет, наличными, по терминалу

На связи каждый день с 09.00 до 20:00 по МСК времени.

❗Цены и остатки могут меняться, уточняйте у наших специалистов. С полным перечнем товаров можно ознакомиться в самом магазине Rimzоnа.'''
    return desc





def format_spring_desc(title: str):
    desc = f'''
<p>{title}. Цена указана за комплект – 4 штуки.<br /> <br /> <strong>Преимущества</strong>:<br /> ▪ Уменьшенный клиренс<br /> ▪ Улучшении управляемости<br /> ▪ Устойчивость на дороге<br /> <br /> <strong>❗Звони прямо сейчас</strong> и мы поможем с выбором.<br /> На связи каждый день<strong> </strong>с 09.00 до 20:00 по МСК времени.<br /> <br /> 🚚 <strong>Доставка</strong> по России транспортными компаниями Деловые Линии, ПЭК, Энергия, КИТ.<br /> <br /> <em>❗Цены и остатки могут меняться, уточняйте у наших специалистов. С полным перечнем товаров можно ознакомиться в самом магазине Rimzona.</em></p>'''
    return desc
